// =======================================================================================
/* 문제 1 */
// student의 schedule이, '화'나 '목'일때만 console.log 찍게하는거
// const student = {
//     name : '지승한',
//     schedule : '목'
// }
// =======================================================================================

// =======================================================================================
// 문제 2
/*
    간단하게 숫자 총합 구하기
    아래 나온 답 말고도 생각해보기
*/
// =======================================================================================
// 답 :
// const num = [1, 3, 51, 58, 12, 18, 3];

// const numReduce = num.reduce((acc, cur) => {
//   return acc + cur;
// }, 0);
// console.log(numReduce);

// result = 0;
// const numForEach = num.forEach((a) => result += a);
// console.log(result);
// =======================================================================================

/* 문제 3
    숫자 총합 구하기
*/
// const num = [1, 3, "a", 58, 12, 18, 3];
// =======================================================================================
//답:
// let result = 0;
// const numFilter = num.filter((v) => {
//   return typeof v === "number";
// });
// result = numFilter.reduce((acc, cur) => {
//   return (acc += cur);
// }, 0);
// console.log(result);
// =======================================================================================

/* 문제 4
    주말만 골라보기
*/
// const week = ["일", "월", "화", "수", "목", "금", "토"];
// =======================================================================================
// 답 :
// let result = [];
// week.forEach(day => {
//     if (['토', '일'].includes(day)) {
//         result.push(day);
//     }
// });
// const weekend = week.filter(day => ['토', '일'].includes(day));

// console.log(weekend);
// =======================================================================================

/* 문제 5
    20살 이상만 뽑아서 넣어
    ex) [{ name: '지승한', age: 33 },{ name: '신영석', age: 22 }]
*/
// const obj = [
//   {
//     name: "고윤태",
//     age: 17,
//   },
//   {
//     name: "지승한",
//     age: 33,
//   },
//   {
//     name: "황대명",
//     age: 15,
//   },
//   {
//     name: "신영석",
//     age: 22,
//   },
// ];
// =======================================================================================
//답 :
// const result = obj.filter((student) => {
//   return student.age >= 20;
// });
// console.log(result);
// =======================================================================================

/*
    문제 6
    step 1 : params를 for문을 돌려서 key=value 형태로 만든다
    step 2 : join

    예시 : 'name=고윤태&age=22'
*/
// =======================================================================================
//답:
// Object.entries(params).forEach((v) => {
//   result.push(v.join("="));
// });
// const result = Object.entries(params)
//   .map((v) => {
//     return v.join("=");
//   })
//   .join("&");

// console.log(result);
// =======================================================================================

/* 문제 7
    아래 string을 객체로 만들어라~
    ex){ '고윤태' : 173, '지승한' : 185, ... }
    // const string = "고윤태:173,지승한:185,황대명:179,이대양:163,김";
*/
// =======================================================================================
//답:
// const result = string.split(",").reduce((acc, cur) => {
//   const [key, value] = cur.split(":");
//   if (value) {
//     acc[key] = value;
//   }
//   return acc;
// }, {});

// console.log(result);
// =======================================================================================

/* 문제 8
    아래 이름중 김씨만 걸러서 배열의 형태로 나타내시오
    // const array = ["김윤태", "지승한", "김대명", "김동현", "임채건"];
*/
// =======================================================================================
//답:
// const arrayFilter = array.filter((name) => {
//   const [firstName, ...names] = name.split("");
//   return firstName === "김";
// });

// console.log(arrayFilter);
// =======================================================================================
